app/controllers/incidents_controller.rb

SELECT "incidents".* FROM "incidents"
---
  def index
    @incidents = Incident.all

INSERT INTO "incidents" ("incident", "name", "email_or_phone", "role", "people_involved", "observers", "observed_at", "location", "location_details", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @incident = Incident.new(incident_params)

    respond_to do |format|
      if @incident.save

SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_incident
      @incident = Incident.find(params[:id])